# Домашнее задание «Библиотека Pandas»

### Задание 1
Скачайте с сайта https://grouplens.org/datasets/movielens/ датасет любого размера. Определите какому фильму было выставлено больше всего оценок 5.0.

In [1]:
import pandas as pd

In [2]:
movies = pd.read_csv('movies.csv')[['movieId', 'title']]
movies.head()

   movieId                               title
0        1                    Toy Story (1995)
1        2                      Jumanji (1995)
2        3             Grumpier Old Men (1995)
3        4            Waiting to Exhale (1995)
4        5  Father of the Bride Part II (1995)

In [3]:
rating = pd.read_csv('ratings.csv')[['movieId', 'rating']]
rating.head()

   movieId  rating
0        1     4.0
1        3     4.0
2        6     4.0
3       47     5.0
4       50     5.0

In [4]:
joined_rating = rating.merge(movies, on='movieId', how='left')
joined_rating.head()

   movieId  rating                        title
0        1     4.0             Toy Story (1995)
1        3     4.0      Grumpier Old Men (1995)
2        6     4.0                  Heat (1995)
3       47     5.0  Seven (a.k.a. Se7en) (1995)
4       50     5.0   Usual Suspects, The (1995)

In [5]:
rating_5 = joined_rating[(rating['rating']==5.0)]
rating_5_count = rating_5.groupby(['movieId', 'title'])['movieId'].count().sort_values(ascending=False)
rating_5_count.head()

movieId  title
318      Shawshank Redemption, The (1994)             153
296      Pulp Fiction (1994)                          123
356      Forrest Gump (1994)                          116
2571     Matrix, The (1999)                           109
260      Star Wars: Episode IV - A New Hope (1977)    104
Name: movieId, dtype: int64

### Задание 2
По данным файла power.csv посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 года. Не учитывайте в расчетах отрицательные значения quantity.

In [6]:
power = pd.read_csv('power.csv')
power.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [7]:
filtered_countries = power[((power['country'] == 'Latvia') | (power['country'] == 'Lithuania') | (power['country'] == 'Estonia')) & ((power['category'] == 4) | (power['category'] == 12) | (power['category'] == 21)) & ((power['year'] <= 2010) & (power['year'] >= 2005)) & (power['quantity'] >= 0)]
filtered_countries_total = filtered_countries['quantity'].sum()

In [8]:
print("Суммарное потребление стран Прибалтики категорий 4, 12 и 21 за период с 2005 по 2010 гг. составляет:", filtered_countries_total)

Суммарное потребление стран Прибалтики категорий 4, 12 и 21 за период с 2005 по 2010 гг. составляет: 240580.0

### Задание 3
Выберите страницу любого сайта с табличными данными. Импортируйте таблицы в pandas dataframe.
Примеры страниц (необязательно брать именно эти):  
https://fortrader.org/quotes  
https://www.finanz.ru/valyuty/v-realnom-vremeni

In [10]:
data = pd.read_html('https://www.global-rates.com/en/', header=[0])[9]
data.head(8)

                                Rate percentage        date
0     Euribor interest rate - 1 week   -0.535 %  08-19-2020
1    Euribor interest rate - 2 weeks   -0.371 %  11-30-2018
2    Euribor interest rate - 1 month   -0.519 %  08-19-2020
3   Euribor interest rate - 2 months   -0.336 %  11-30-2018
4   Euribor interest rate - 3 months   -0.488 %  08-19-2020
5   Euribor interest rate - 6 months   -0.442 %  08-19-2020
6   Euribor interest rate - 9 months   -0.194 %  11-30-2018
7  Euribor interest rate - 12 months   -0.366 %  08-19-2020